[Killed] ObjectLiteral
main/components/Courses/CoursesForm.js:106:55
                                 id="start"
                                 type="datetime-local"
                                 isInvalid={Boolean(errors.start)}
-                                {...register("start", { 
-                                    required: "Start is required." 
-                                })}
+                                {...register("start", {})}
                             />
                             <Form.Control.Feedback type="invalid">
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Start is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Courses/CoursesForm.js:119:61
                     <Form.Group className="mb-3" >
                             <Form.Label htmlFor="end">End (iso format)</Form.Label>
                             <Form.Control
-                                data-testid={testIdPrefix + "-end"}
+                                data-testid={testIdPrefix + ""}
                                 id="end"
                                 type="datetime-local"
killedBy: CoursesForm tests No Error messsages on good input
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesForm-end"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Courses/CoursesForm.js:123:53
                                 id="end"
                                 type="datetime-local"
                                 isInvalid={Boolean(errors.end)}
-                                {...register("end", { 
-                                    required: "End is required." 
-                                })}
+                                {...register("end", {})}
                             />
                             <Form.Control.Feedback type="invalid">
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /End is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Courses/CoursesForm.js:123:46
                                 id="end"
                                 type="datetime-local"
                                 isInvalid={Boolean(errors.end)}
-                                {...register("end", { 
+                                {...register("", { 
                                     required: "End is required." 
                                 })}
killedBy: CoursesForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
