[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:47:17
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_ADMIN") && (
-                  <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown" >
-                    <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
-                    <NavDropdown.Item href="/admin/jobs">Manage Jobs</NavDropdown.Item>
-                    <NavDropdown.Item href="/admin/courses">Manage Courses</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                true
               }
               {
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:47:17
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_ADMIN") && (
-                  <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown" >
-                    <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
-                    <NavDropdown.Item href="/admin/jobs">Manage Jobs</NavDropdown.Item>
-                    <NavDropdown.Item href="/admin/courses">Manage Courses</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                false
               }
               {
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Survived] ConditionalExpression
main/components/Nav/AppNavbar.js:56:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="User" id="appnavbar-user-dropdown" data-testid="appnavbar-user-dropdown" >
-                    <NavDropdown.Item href="/courses">Manage Jobs</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                true
               }
             </Nav>

[Survived] LogicalOperator
main/components/Nav/AppNavbar.js:56:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="User" id="appnavbar-user-dropdown" data-testid="appnavbar-user-dropdown" >
-                    <NavDropdown.Item href="/courses">Manage Jobs</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                hasRole(currentUser, "ROLE_USER") || <NavDropdown title="User" id="appnavbar-user-dropdown" data-testid="appnavbar-user-dropdown">
+                    <NavDropdown.Item href="/courses">Manage Jobs</NavDropdown.Item>
+                  </NavDropdown>
               }
             </Nav>
