[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:56:16
               }
             </Nav>
             {
-              (hasRole(currentUser, "ROLE_INSTRUCTOR") || hasRole(currentUser, "ROLE_ADMIN")) && (
+              (true) && (
                 <>
                   <Nav.Link as={Link} to="/courses">Courses</Nav.Link>
killedBy: AppNavbar tests doesnt render the Course link for non admin/instructor
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a class="nav-link" href="/courses">Courses</a> instead

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:56:15
               }
             </Nav>
             {
-              (hasRole(currentUser, "ROLE_INSTRUCTOR") || hasRole(currentUser, "ROLE_ADMIN")) && (
-                <>
-                  <Nav.Link as={Link} to="/courses">Courses</Nav.Link>
-                </>
-              )
+              hasRole(currentUser, "ROLE_INSTRUCTOR") || hasRole(currentUser, "ROLE_ADMIN") || <>
+                  <Nav.Link as={Link} to="/courses">Courses</Nav.Link>
+                </>
             }
             <Nav className="ml-auto">
killedBy: AppNavbar tests renders the Course link for admins
statusReason: Error: Unable to find an element with the text: Courses. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >
