[Killed] ObjectLiteral
main/components/Courses/CoursesForm.js:84:42
                     id="term"
                     type="text"
                     isInvalid={Boolean(errors.term)}
-                    {...register("term", {
-                        required: "Term is required."
-                    })}
+                    {...register("term", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Term is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Courses/CoursesForm.js:85:35
                     type="text"
                     isInvalid={Boolean(errors.term)}
                     {...register("term", {
-                        required: "Term is required."
+                        required: ""
                     })}
                 />
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Term is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Courses/CoursesForm.js:103:26
                         {...register("start", { required: true, pattern: isodate_regex })}
                     />
                     <Form.Control.Feedback type="invalid">
-                        {errors.start && 'Start is required. '}
+                        {errors.start || 'Start is required. '}
                     </Form.Control.Feedback>
             </Form.Group>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/Courses/CoursesForm.js:103:26
                         {...register("start", { required: true, pattern: isodate_regex })}
                     />
                     <Form.Control.Feedback type="invalid">
-                        {errors.start && 'Start is required. '}
+                        {false}
                     </Form.Control.Feedback>
             </Form.Group>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Start is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Courses/CoursesForm.js:117:26
                         {...register("end", { required: true, pattern: isodate_regex })}
                     />
                     <Form.Control.Feedback type="invalid">
-                        {errors.end && 'End is required. '}
+                        {errors.end || 'End is required. '}
                     </Form.Control.Feedback>
             </Form.Group>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/Courses/CoursesForm.js:117:26
                         {...register("end", { required: true, pattern: isodate_regex })}
                     />
                     <Form.Control.Feedback type="invalid">
-                        {errors.end && 'End is required. '}
+                        {true}
                     </Form.Control.Feedback>
             </Form.Group>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /End is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Courses/CoursesForm.js:128:47
                     id="githubOrg"
                     type="text"
                     isInvalid={Boolean(errors.githubOrg)}
-                    {...register("githubOrg", {
-                        required: "GithubOrg is required."
-                    })}
+                    {...register("githubOrg", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /GithubOrg is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
