[Killed] ArrowFunction
main/pages/Courses/CoursesCreatePage.js:9:31
 
 export default function CoursesCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (course) => ({
-    url: "/api/courses/post",
-    method: "POST",
-    params: {
-      name: course.name,
-      school: course.school,
-      term: course.term,
-      start: course.start,
-      end: course.end,
-      githubOrg: course.githubOrg
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (course) => {
killedBy: CourseCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
