[Killed] StringLiteral
main/components/Courses/CoursesTable.js:47:23
         },
         {
             Header: 'Start Date',
-            accessor: 'start',
+            accessor: "",
         },
         {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-start"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] ObjectLiteral
main/components/Courses/CoursesTable.js:49:9
             Header: 'Start Date',
             accessor: 'start',
         },
-        {
-            Header: 'End Date',
-            accessor: 'end',
-        },
+        {},
         {
             Header: 'GitHub Org',
killedBy: UserTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:60:43
     ];
 
     if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "CoursesTable"));
+        columns.push(ButtonColumn("Edit", "", editCallback, "CoursesTable"));
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "CoursesTable"));
     }
killedBy: UserTable tests Has the expected colum headers and content for instructorUser
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:61:35
 
     if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
         columns.push(ButtonColumn("Edit", "primary", editCallback, "CoursesTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "CoursesTable"));
+        columns.push(ButtonColumn("", "danger", deleteCallback, "CoursesTable"));
     }
 
killedBy: UserTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:61:71
 
     if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
         columns.push(ButtonColumn("Edit", "primary", editCallback, "CoursesTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "CoursesTable"));
+        columns.push(ButtonColumn("Delete", "danger", deleteCallback, ""));
     }
 
killedBy: UserTable tests Has the expected colum headers and content for instructorUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-Delete-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:67:17
     return <OurTable
         data={courses}
         columns={columns}
-        testid={"CoursesTable"} />;
+        testid={""} />;
 };
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-id"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"
