[Killed] BlockStatement
main/components/Users/UsersTable.js:8:49
 
 export default function UsersTable({ users, showToggleButtons = false }) {
     //toggleAdmin
-    function cellToAxiosParamsToggleAdmin(cell) {
-        return {
-            url: "/api/admin/users/toggleAdmin",
-            method: "POST",
-            params: {
-                id: cell.row.values.githubId
-            }
-        }
-    }
+    function cellToAxiosParamsToggleAdmin(cell) {}
 
     // Stryker disable all : hard to test for query caching
killedBy: AdminUsersPage tests toggle buttons trigger requests for three users
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

<html>
  <head />

[Killed] ObjectLiteral
main/components/Users/UsersTable.js:9:16
 export default function UsersTable({ users, showToggleButtons = false }) {
     //toggleAdmin
     function cellToAxiosParamsToggleAdmin(cell) {
-        return {
-            url: "/api/admin/users/toggleAdmin",
-            method: "POST",
-            params: {
-                id: cell.row.values.githubId
-            }
-        }
+        return {}
     }
 
killedBy: AdminUsersPage tests toggle buttons trigger requests for three users
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

<html>
  <head />

[Killed] ObjectLiteral
main/components/Users/UsersTable.js:12:21
         return {
             url: "/api/admin/users/toggleAdmin",
             method: "POST",
-            params: {
-                id: cell.row.values.githubId
-            }
+            params: {}
         }
     }
killedBy: AdminUsersPage tests toggle buttons trigger requests for three users
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 22222
Received: undefined

<html>
  <head />
  <body>

[Killed] BlockStatement
main/components/Users/UsersTable.js:32:54
     const toggleAdminCallback = async (cell) => { toggleAdminMutation.mutate(cell); }
     
     //toggleInstructor
-    function cellToAxiosParamsToggleInstructor(cell) {
-        return {
-            url: "/api/admin/users/toggleInstructor",
-            method: "POST",
-            params: {
-                id: cell.row.values.githubId
-            }
-        }
-    }
+    function cellToAxiosParamsToggleInstructor(cell) {}
 
     // Stryker disable all : hard to test for query caching
killedBy: AdminUsersPage tests toggle buttons trigger requests for three users
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1

<html>
  <head />
