[Killed] ArrowFunction
main/pages/Courses/CoursesEditPage.js:24:36
             }
         );
 
-    const objectToAxiosPutParams = (course) => ({
-        url: "/api/courses/update",
-        method: "PUT",
-        params: {
-            courseId: course.id,
-        },
-        data: {
-            name: course.name,
-            school: course.school,
-            term: course.term,
-            start: course.start,
-            end: course.end,
-            githubOrg: course.githubOrg
-        }
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (course) => {
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/Courses/CoursesEditPage.js:27:17
     const objectToAxiosPutParams = (course) => ({
         url: "/api/courses/update",
         method: "PUT",
-        params: {
-            courseId: course.id,
-        },
+        params: {},
         data: {
             name: course.name,
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "courseId": 1,
- }

[Killed] ObjectLiteral
main/pages/Courses/CoursesEditPage.js:30:15
         params: {
             courseId: course.id,
         },
-        data: {
-            name: course.name,
-            school: course.school,
-            term: course.term,
-            start: course.start,
-            end: course.end,
-            githubOrg: course.githubOrg
-        }
+        data: {}
     });
 
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"name\":\"CS130\",\"school\":\"UC Berkely\",\"term\":\"W24\",\"start\":\"2023-08-03T00:00:02.000\",\"end\":\"2024-01-03T00:00:02.000\",\"githubOrg\":\"CMPSC130\"}"
Received: "{}"

[Killed] ConditionalExpression
main/pages/Courses/CoursesEditPage.js:66:21
             <div className="pt-2">
                 <h1>Edit Course</h1>
                 {
-                    course && <CoursesForm initialContents={course} submitAction={onSubmit} buttonLabel={"Update"} />
+                    true
                 }
             </div>
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="CoursesForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/pages/Courses/CoursesEditPage.js:66:21
             <div className="pt-2">
                 <h1>Edit Course</h1>
                 {
-                    course && <CoursesForm initialContents={course} submitAction={onSubmit} buttonLabel={"Update"} />
+                    false
                 }
             </div>
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="CoursesForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
