[Killed] BlockStatement
main/pages/Courses/CoursesIndexPage.js:13:32
 
     const currentUser = useCurrentUser();
 
-    const createButton = () => {
-        if (hasRole(currentUser, "ROLE_ADMIN")) {
-            return (
-                <Button
-                    variant="primary"
-                    href="/courses/create"
-                    style={{ float: "right" }}
-                >
-                    Create New Course
-                </Button>
-            )
-        }
-    }
+    const createButton = () => {}
 
     const { data: courses, error: _error, status: _status } =
killedBy: CoursesIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create New Course/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BlockStatement
main/pages/Courses/CoursesIndexPage.js:14:49
     const currentUser = useCurrentUser();
 
     const createButton = () => {
-        if (hasRole(currentUser, "ROLE_ADMIN")) {
-            return (
-                <Button
-                    variant="primary"
-                    href="/courses/create"
-                    style={{ float: "right" }}
-                >
-                    Create New Course
-                </Button>
-            )
-        }
+        if (hasRole(currentUser, "ROLE_ADMIN")) {}
     }
 
killedBy: CoursesIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create New Course/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
main/pages/Courses/CoursesIndexPage.js:31:7
     useBackend(
       // Stryker disable next-line all : don't test internal caching of React Query
       ["/api/courses/all"],
-      { method: "GET", url: "/api/courses/all" },
+      {},
       // Stryker disable next-line all : don't test empty
       []
killedBy: CoursesIndexPage tests renders three reviews correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
