[Killed] BlockStatement
main/components/Utils/CoursesUtils.js:8:47
     toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/courses/delete",
-        method: "DELETE",
-        params: {
-            courseId: cell.row.values.id
-        }
-    }
-}
+export function cellToAxiosParamsDelete(cell) {}
killedBy: CoursesIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Course with id 1 was deleted"

Number of calls: 0

<html>
  <head />

[Killed] ObjectLiteral
main/components/Utils/CoursesUtils.js:9:12
 }
 
 export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/courses/delete",
-        method: "DELETE",
-        params: {
-            courseId: cell.row.values.id
-        }
-    }
+    return {}
 }
killedBy: CoursesIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Course with id 1 was deleted"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Utils/CoursesUtils.js:10:14
 
 export function cellToAxiosParamsDelete(cell) {
     return {
-        url: "/api/courses/delete",
+        url: "",
         method: "DELETE",
         params: {
killedBy: CoursesIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Course with id 1 was deleted"

Number of calls: 0

<html>
  <head />
