[Killed] BlockStatement
src/main/utils/currentUser.js:44:44
     && currentUser.root.rolesList
     && currentUser.root.rolesList.includes(role)
 }*/
-export function hasRole(currentUser, role) {
-
-  // The following hack is because there is some bug in terms of the
-  // shape of the data returned by useCurrentUser.  Is there a separate 
-  // data level, or not? 
-
-  // We will file an issue to track that down and then remove this hack
-
-  if (currentUser == null) return false;
-
-  if ("data" in currentUser &&
-    "root" in currentUser.data &&
-    currentUser.data.root != null &&
-    "rolesList" in currentUser.data.root) {
-    return currentUser.data.root.rolesList.includes(role);
-  }
-
-  return currentUser.root?.rolesList?.includes(role);
-}
+export function hasRole(currentUser, role) {}
killedBy: utils/currentUser tests hasRole tests hasRole(x,"ROLE_ADMIN") returns correct values when currentUser properly defined
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] ConditionalExpression
src/main/utils/currentUser.js:54:7
 
   if (currentUser == null) return false;
 
-  if ("data" in currentUser &&
-    "root" in currentUser.data &&
-    currentUser.data.root != null &&
-    "rolesList" in currentUser.data.root) {
+  if (true) {
     return currentUser.data.root.rolesList.includes(role);
   }
killedBy: CoursesIndexPage tests Renders with Create Button for admin user
statusReason: TypeError: Cannot read properties of null (reading 'rolesList')

[Killed] ConditionalExpression
src/main/utils/currentUser.js:54:7
 
   if (currentUser == null) return false;
 
-  if ("data" in currentUser &&
-    "root" in currentUser.data &&
-    currentUser.data.root != null &&
+  if (true &&
     "rolesList" in currentUser.data.root) {
     return currentUser.data.root.rolesList.includes(role);
killedBy: utils/currentUser tests hasRole tests hasRole(x,"ROLE_ADMIN") return falsy when currentUser ill-defined
statusReason: TypeError: Cannot read properties of undefined (reading 'root')
