[Killed] ArrowFunction
main/pages/Courses/CoursesEditPage.js:24:36
             }
         );
 
-    const objectToAxiosPutParams = (course) => ({
-        url: "/api/courses/update",
-        method: "PUT",
-        params: {
-            id: course.id,
-        },
-        data: {
-            name: course.name,
-            school: course.school,
-            term: course.term,
-            start: course.start,
-            end: course.end,
-            githubOrg: course.githubOrg
-        }
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (course) => {
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>
