[Killed] LogicalOperator
main/components/Courses/CoursesForm.js:25:22
         <Form onSubmit={handleSubmit(submitAction)}>
             <Row>
                 <Col>
-                    {initialContents && (
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid={testIdPrefix + "-id"}
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    )}
+                    {initialContents || <Form.Group className="mb-3">
+                            <Form.Label htmlFor="id">Id</Form.Label>
+                            <Form.Control data-testid={testIdPrefix + "-id"} id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+                        </Form.Group>}
                 </Col>
             </Row>
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, name, school, term, startDate, endDate, githubOrg}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/Courses/CoursesForm.js:25:22
         <Form onSubmit={handleSubmit(submitAction)}>
             <Row>
                 <Col>
-                    {initialContents && (
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid={testIdPrefix + "-id"}
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    )}
+                    {true}
                 </Col>
             </Row>
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/components/Courses/CoursesForm.js:64:57
                     <Form.Group className="mb-3" >
                         <Form.Label htmlFor="school">School</Form.Label>
                         <Form.Control
-                            data-testid={testIdPrefix + "-school"}
+                            data-testid={testIdPrefix + ""}
                             id="school"
                             type="text"
killedBy: CoursesForm tests No Error messsages on good input
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesForm-school"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Courses/CoursesForm.js:68:42
                             id="school"
                             type="text"
                             isInvalid={Boolean(errors.school)}
-                            {...register("school", {
+                            {...register("", {
                                 required: "School is required."
                             })}
killedBy: CoursesForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/Courses/CoursesForm.js:69:43
                             type="text"
                             isInvalid={Boolean(errors.school)}
                             {...register("school", {
-                                required: "School is required."
+                                required: ""
                             })}
                         />
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /School is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Courses/CoursesForm.js:106:46
                                 id="startDate"
                                 type="datetime-local"
                                 isInvalid={Boolean(errors.startDate)}
-                                {...register("startDate", { 
+                                {...register("", { 
                                     required: "StartDate is required." 
                                 })}
killedBy: CoursesForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/Courses/CoursesForm.js:111:34
                                 })}
                             />
                             <Form.Control.Feedback type="invalid">
-                                {errors.startDate?.message}
+                                {errors.startDate.message}
                             </Form.Control.Feedback>
                     </Form.Group>
killedBy: CoursesForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/Courses/CoursesForm.js:119:61
                     <Form.Group className="mb-3" >
                             <Form.Label htmlFor="endDate">End (iso format)</Form.Label>
                             <Form.Control
-                                data-testid={testIdPrefix + "-endDate"}
+                                data-testid={testIdPrefix + ""}
                                 id="endDate"
                                 type="datetime-local"
killedBy: CoursesForm tests No Error messsages on good input
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesForm-endDate"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Courses/CoursesForm.js:123:46
                                 id="endDate"
                                 type="datetime-local"
                                 isInvalid={Boolean(errors.endDate)}
-                                {...register("endDate", { 
+                                {...register("", { 
                                     required: "EndDate is required." 
                                 })}
killedBy: CoursesForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/Courses/CoursesForm.js:142:42
                             id="githubOrg"
                             type="text"
                             isInvalid={Boolean(errors.githubOrg)}
-                            {...register("githubOrg", {
+                            {...register("", {
                                 required: "GithubOrg is required."
                             })}
killedBy: CoursesForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
