[Killed] StringLiteral
main/components/Courses/CoursesTable.js:47:23
         },
         {
             Header: 'Start Date',
-            accessor: 'startDate',
+            accessor: "",
         },
         {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-startDate"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] ObjectLiteral
main/components/Courses/CoursesTable.js:49:9
             Header: 'Start Date',
             accessor: 'startDate',
         },
-        {
-            Header: 'End Date',
-            accessor: 'endDate',
-        },
+        {},
         {
             Header: 'GitHub Org',
killedBy: UserTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:61:35
 
     // Stryker disable next-line all
     if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "CoursesTable"));
+        columns.push(ButtonColumn("", "primary", editCallback, "CoursesTable"));
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "CoursesTable"));
     }
killedBy: UserTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:61:68
 
     // Stryker disable next-line all
     if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "CoursesTable"));
+        columns.push(ButtonColumn("Edit", "primary", editCallback, ""));
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "CoursesTable"));
     }
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:62:45
     // Stryker disable next-line all
     if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
         columns.push(ButtonColumn("Edit", "primary", editCallback, "CoursesTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "CoursesTable"));
+        columns.push(ButtonColumn("Delete", "", deleteCallback, "CoursesTable"));
     }
 
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Error: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn
