[Killed] StringLiteral
main/pages/Courses/CoursesCreatePage.js:10:10
 export default function CoursesCreatePage({storybook=false}) {
 
   const objectToAxiosParams = (course) => ({
-    url: "/api/courses/post",
+    url: "",
     method: "POST",
     params: {
killedBy: CourseCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New course created - id: 1"

Number of calls: 0
