[Killed] ArrowFunction
main/pages/Courses/CoursesEditPage.js:25:34
     );
 
 
-  const objectToAxiosPutParams = (course) => ({
-    url: "/api/courses",
-    method: "PUT",
-    params: {
-      courseId: course.id,
-    },
-    data: {
-      name: course.name,
-      school: course.school,
-      term: course.term,
-      startDate: course.startDate,
-      endDate: course.endDate,
-      githubOrg: course.githubOrg
-    }
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (course) => {
killedBy: CoursesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/Courses/CoursesEditPage.js:41:33
     }
   });
 
-  const onSuccess = (course) => {
-    toast(`Course updated - id: ${course.id}`);
-  }
+  const onSuccess = (course) => {}
 
   const mutation = useBackendMutation(
killedBy: CoursesEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>
