[Killed] ConditionalExpression
main/pages/Courses/CoursesIndexPage.js:14:9
   const { data: currentUser } = useCurrentUser();
 
   const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) {
+    if (true) {
         return (
             <Button
killedBy: CoursesIndexPage tests renders three courses correctly for regular user
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a class="btn btn-primary" href="/courses/create" role="button" style="float: right;" tabindex="0">Create Course</a> instead
