[Killed] ObjectLiteral
main/components/Users/UsersTable.js:32:5
         id: 'admin',
         accessor: (row, _rowIndex) => String(row.admin) // hack needed for boolean values to show up
     },
-    {
-        Header: 'Instructor',
-        id: 'instructor',
-        accessor: (row, _rowIndex) => String(row.instructor)
-    }
+    {}
 ];
 
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Users/UsersTable.js:34:13
     },
     {
         Header: 'Instructor',
-        id: 'instructor',
+        id: "",
         accessor: (row, _rowIndex) => String(row.instructor)
     }
killedBy: UserTable tests Has the expected colum headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-instructor"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] ArrowFunction
main/components/Users/UsersTable.js:35:19
     {
         Header: 'Instructor',
         id: 'instructor',
-        accessor: (row, _rowIndex) => String(row.instructor)
+        accessor: () => undefined
     }
 ];
killedBy: UserTable tests Has the expected colum headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  false
Received:
