[Killed] StringLiteral
src/main/pages/ProfilePage.js:24:28
                 User Profile for {currentUser.root.user.githubLogin}
             </h1>
             <UsersTable users={[currentUser.root.user]} />
-            <h2 className={"mt-3 mb-3"}>
+            <h2 className={""}>
                 Emails
             </h2>
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: Error: expect(element).toHaveClass("mt-3")

Expected the element to have class:
  mt-3
Received:

[Killed] StringLiteral
src/main/pages/ProfilePage.js:28:28
                 Emails
             </h2>
             <UserEmailsTable emails={currentUser.root.user.emails} />
-            <h2 className={"mt-3 mb-3"}>
+            <h2 className={""}>
                 Debugging Information
             </h2>
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: Error: expect(element).toHaveClass("mt-3")

Expected the element to have class:
  mt-3
Received:
