[Killed] ObjectLiteral
main/components/Users/UsersTable.js:31:16
     
     //toggleInstructor
     function cellToAxiosParamsToggleInstructor(cell) {
-        return {
-            url: "/api/admin/users/toggleInstructor",
-            method: "POST",
-            params: {
-                id: cell.row.values.githubId
-            }
-        }
+        return {}
     }
 
killedBy: AdminUsersPage tests toggle buttons trigger requests for three users
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1

<html>
  <head />
